In [11]:
import pandas as pd

df1= pd.DataFrame({
    'Id':[1,2,3,4],
    'City':['Mum','Del','Blr','Kol'],
    'temp':[38, 54, 30, 48],
    'humid':[80,83,67,88]  
})


df2= pd.DataFrame({
    'Id':[1,3,4],
    'City':['Mum','Blr','Kol'],
    'temp':[38, 30, 48],
    'humid':[80, 67, 0]    
})


df3= pd.DataFrame({
    'Id':[1,2,3,4],
    'City':['Mum','Del','Blr','Kol'],
    'temp':[38, 54, 30, 48],
    'humid':[80,83,67,88],  
    'Cntry':['Ind','Ind','Ind','Ind']
})

**Operations on overall df**
--Common Columns between 2 dfs

In [14]:
set(df1) & set(df3)

{'City', 'Id', 'humid', 'temp'}

**Operations on 1 Column of df**
--Which Id of df1 is also present in df2   and Vice Versa ie "Not Present" in df2

In [15]:
set(df1.Id) & set(df2.Id)

{1, 3, 4}

--If we want data for matching Ids

In [17]:
df1[df1.Id.isin(df2.Id)]

   Id City  temp  humid
0   1  Mum    38     80
2   3  Blr    30     67
3   4  Kol    48     88

--If we want data for NON-MATCHING Ids

In [18]:
df1[~df1.Id.isin(df2.Id)]

   Id City  temp  humid
1   2  Del    54     83

**Another way to merge with indicator[without ON and]**

In [34]:
pd.merge(df1, df2,  how='outer', indicator=True)

   Id City  temp  humid      _merge
0   1  Mum    38     80        both
1   2  Del    54     83   left_only
2   3  Blr    30     67        both
3   4  Kol    48     88   left_only
4   4  Kol    48      0  right_only

**Operations on Row wise of df**
--Row wise matching between 2 Tables.(Matching row for all columns) **Humid is not matching for ID=4, so not consid as same row

In [36]:
df1.merge(df2,  how='inner')

   Id City  temp  humid
0   1  Mum    38     80
1   3  Blr    30     67

**Rows present in df2 but NOT present in df1**

In [37]:
df2.merge(df1, how='inner')

   Id City  temp  humid
0   1  Mum    38     80
1   3  Blr    30     67

**Row of df1 which is present in df2, [But if any column in NOT common between them then for that algo will not match eg:Cntry]

In [38]:
df1.merge(df3, how='inner')

   Id City  temp  humid Cntry
0   1  Mum    38     80   Ind
1   2  Del    54     83   Ind
2   3  Blr    30     67   Ind
3   4  Kol    48     88   Ind

# Merge in Python

In [40]:
pd.merge(df1, df2, on='Id', how='left')

   Id City_x  temp_x  humid_x City_y  temp_y  humid_y
0   1    Mum      38       80    Mum    38.0     80.0
1   2    Del      54       83    NaN     NaN      NaN
2   3    Blr      30       67    Blr    30.0     67.0
3   4    Kol      48       88    Kol    48.0      0.0

**When Merging key has different names?**
**Keeping Postfix for identification* 
**Also adding 'Indicator' to identify which Id(as joinkey is Id) is from which DF

In [45]:
pd.merge(df1, df2, left_on='Id', right_on='Id', how='left', suffixes=('_left','_right'), indicator=True)

,Id,City_left,temp_left,humid_left,City_right,temp_right,humid_right,_merge
0,1,Mum,38,80,Mum,38.0,80.0,both
1,2,Del,54,83,NaN,NaN,NaN,left_only
2,3,Blr,30,67,Blr,30.0,67.0,both
3,4,Kol,48,88,Kol,48.0,0.0,both

# Concat in Pandas
-- 1. Concat 1 below 2nd
-- 2. Concat Side by side

In [47]:
pd.concat([df1,df2])

   Id City  temp  humid
0   1  Mum    38     80
1   2  Del    54     83
2   3  Blr    30     67
3   4  Kol    48     88
0   1  Mum    38     80
1   3  Blr    30     67
2   4  Kol    48      0

In [48]:
pd.concat([df1, df2], axis=1)

   Id City  temp  humid   Id City  temp  humid
0   1  Mum    38     80  1.0  Mum  38.0   80.0
1   2  Del    54     83  3.0  Blr  30.0   67.0
2   3  Blr    30     67  4.0  Kol  48.0    0.0
3   4  Kol    48     88  NaN  NaN   NaN    NaN

Rows in both the above table is Not same, so NaN for 4th row in 2nd Table

In [49]:
pd.concat([df1, df3], axis=1)

   Id City  temp  humid  Id City  temp  humid Cntry
0   1  Mum    38     80   1  Mum    38     80   Ind
1   2  Del    54     83   2  Del    54     83   Ind
2   3  Blr    30     67   3  Blr    30     67   Ind
3   4  Kol    48     88   4  Kol    48     88   Ind

**As we want to concat based on some Index, So we have to create a df with index**
Creatig table with Index and will Concat wrt to Index

In [55]:
df1= pd.DataFrame({
    'Id':[1,2,3,4],
    'City':['Mum','Del','Blr','Kol'],
    'temp':[38, 54, 30, 48],
    'humid':[80,83,67,88]  
}, index= [1,2,3,4])


df2= pd.DataFrame({
    'Id':[1,3,4],
    'City':['Mum','Blr','Kol'],
    'temp':[38, 30, 48],
    'humid':[80, 67, 0]    
}, index= [1,3,4])

In [62]:
pd.concat([df1, df2], axis=1, ignore_index=False)

   Id City  temp  humid   Id City  temp  humid
1   1  Mum    38     80  1.0  Mum  38.0   80.0
2   2  Del    54     83  NaN  NaN   NaN    NaN
3   3  Blr    30     67  3.0  Blr  30.0   67.0
4   4  Kol    48     88  4.0  Kol  48.0    0.0